Repository: knomepasi/WordPress
Catalog: plugins/taxonomy-promotion/languages/taxonomy-promotion-*.po
Languages: fi

source: Taxonomy Promotion
fi: Taksonomioiden promootio

source: Widget that shows posts from the selected taxonomy and term.
fi: Vimpain joka näyttää artikkeleita valitusta taksonomiasta ja termistä.

source: Shows posts from the selected taxonomy and term.
fi: Näyttää artikkeleita valitusta taksonomiasta ja termistä.

# widget name
source: Taxonomy Promotion
fi: Taksonomioiden promootio

source: Read more
fi: Lue lisää

source: Title
fi: Otsikko

source: Terms
fi: Termit

source: Display
fi: Näytä

source: Title list
fi: Otsikkolista

source: Title, Excerpt
fi: Otsikko, Ote

source: Featured image, Title, Excerpt
fi: Artikkelikuva, Otsikko, Ote

source: Item count
fi: Artikkeleiden määrä

source: Offset
fi: Siirtymä alusta

source: Set count to 0 for all items.
fi: Määrän arvolla 0 kaikki artikkelit listataan.

source: Text for 'more items' link
fi: Teksti 'lisää kohteita' -linkille

source: <b>Only if number of items is more than 0.</b> If you leave this field empty, no link will be shown.
fi: <b>Vain jos listauksen pituus on yli 0.</b> Jos jätät tämän kentän tyhjäksi, linkkiä ei näytetä.
