Repository: knomepasi/WordPress
Catalog: plugins/article-series/languages/article-series-*.po
Languages: fi

source: Article Series
fi: Artikkelisarjat

source: Organize your articles in article series and promote the created series with a widget.
fi: Järjestä artikkelisi artikkelisarjoihin ja esittele luotuja sarjoja vimpaimella.

# Taxonomy name
source: Article series
fi: Artikkelisarjat

# Taxonomy name (singular)
source: Article series
fi: Artikkelisarjat

source: Search Series
fi: Etsi artikkelisarjoista

source: All Series
fi: Kaikki artikkelisarjat

source: Parent Series
fi: Ylemmän tason artikkelisarja

source: Parent Series:
fi: Ylemmän tason artikkelisarja:

source: Edit Series
fi: Muokkaa artikkelisarjaa

source: Update Series
fi: Päivitä artikkelisarja

source: Add New Series
fi: Lisää artikkelisarja

source: New Series name
fi: Uuden artikkelisarjan nimi

source: Separate series by commas
fi: Erottele artikkelisarjat pilkuilla

source: Add or remove series
fi: Lisää tai poista artikkelisarjoja

source: Choose from the most used series
fi: Valitse useimmin käytetyistä artikkelisarjoista

source: No Series found
fi: Artikkelisarjoja ei löytynyt

source: No Series found in trash
fi: Artikkelisarjoja ei löytynyt roskakorista

source: Series
fi: Artikkelisarjat

source: This article is part of the article serie %1$s.
fi: Tämä artikkeli on osa artikkelisarjaa %1$s.

source: Serie
fi: Artikkelisarja

# widget name
source: Article series
fi: Artikkelisarjat

source: Promote article series.
fi: Mainosta artikkelisarjoja.

source: Read the article series
fi: Lue artikkelisarjaa

source: -- Random series --
fi: -- Satunnainen artikkelisarja --
